Repository: fjumeaux/FrisquetConnectDomoticz
Catalog: locale/*/LC_MESSAGES/Frisquet-Connect.po
Languages: fr

source: Invalid or expired token, new token retrieval
fr: Token invalide ou expiré, récupération d'un nouveau token

source: Device %(name)s was last updated at %(date)s
fr: Dispositif %(name) a été mise à jour pour la dernière fois le %(date)s

source: Starting Connect To Frisquet
fr: Démarrage de la connexion à Frisquet

source: Payload to push :
fr: Payload à envoyer

source: Starting Connection to
fr: Démarrage de la connexion à

source: Starting data retrieval
fr: Démarrage de la récupération des données

source: Starting energy consumption retrieval
fr: Démarrage de la récupération de consommation d'énergie

source: Starting Push Data
fr: Démarrage de l'envoi des données

source: Updating %s with value 0
fr: Mise à jour de %s avec la valeur 0

source: Switch Selector value is %s, value to update is %d
fr: Interrupteur à la valeur %s, valeur à mettre à jour est %d

source: Updating current energy consumption : %s
fr: Mise à jour de la consommation actuelle d'énergie : %s

source: Updating total energy consumption : %s
fr: Mise à jour de la consommation totale d'énergie : %s

source: Energy consumption storage :
fr: Stockage de la consommation d'énergie :

source: Value to return :
fr: Valeur à retourner :

source: Initializing historical data for
fr: Initialisation des valeur d'historique pour

source: for %(name)s , total energy consumption is %(te)d KWh at %(date)s
fr: Pour %(name)s, la consommation totale d'énergie est de %(te)d KWh à la date du %(date)s

source: For %(name)s , total energy consumption of %(te)d KWh was stored, difference of %(diff)d KWh
fr: Pour %(name)s, la consommation totale d'énergie est de %(te)d à la date du %(diff)s

source: Initializing energy data for %(name)s between %(d1)s and %(d2)s
fr: Initialisation des données d'énergie pour %(name)s entre le %(d1)s et le %(d2)s

source: Processing
fr: Traitement de

source: For %(name)s , total energy consumption is %(te)d KWh at %(date)s
fr: Pour %(name)s, la consommation totale d'énergie est de %(te)d à la date du %(date)s

source: Nothing to update for %(name)s at %(date)s
fr: Rien n'à mettre à jour pour %(name)s au %(date)s

source: Updating %(name)s , incoming value : %(value)s
fr: Mise à jour de %(name)s, valeur reçue : %(value)s

source: Updating %(name)s to value %(value)s
fr: Mise à jour de %(name)s à la valeur %(value)s

source: Creating device %(name)s with unit %(unit)s and TypeName %(typename)s
fr: Création du dispositif %(name)s avec numéro d'unit %(unit)s et TypeName %(typename)s

source: Creating device %(name)s with unit %(unit)s, Type %(type)s and Subtype %(subtype)s
fr: Création du dispositif %(name)s avec numéro d'unit %(unit)s, Type %(type)s et SubType %(subtype)s

source: Starting Frisquet-connect
fr: Démarrage de Frisquet-Connect

source: Boiler ID %s is not valid. Check your entry
fr: Numéro de chaudière %s non valide. Vérifiez votre saisie

source: onStop called
fr: onStop appelé

source: onConnect started for :
fr: onConnect démarré pour :

source: Failed to connect (%(status)s) to %(address)s with error %(error)s
fr: Impossible de se connecter à %(address)s, erreur (%(statut)s) %(error)s

source: Unknown connection
fr: Connection inconnue

source: Method : %(method)s , URL : %(url)s
fr: Méthode : %(method)s, URL : %(url)s

source: onMessage called for
fr: onMessage appelée pour

source: Login Error : Username or password incorrect?
fr: Erreur de connexion : Utilisateur et mot de passe incorrect?

source: Server send an error %(status)d - %(message)s for %(name)s
fr: Le serveur a retourné une erreur %(status)d - %(message)s pour %(name)s

source: Server send an error %d for %s
fr: Le serveur a retourner une erreur %d pour %s

source: token received :
fr: Token reçu :

source: Boiler ID :
fr: Numéro de chaudière :

source: Data has been sent and received
fr: Données correctement reçues et envoyées

source: onCommand called for Unit %(unit)d : Parameter '%(param)s', Level: %(level)d
fr: onCommand appelé pour Unit %(unit)d : Paramètre '%(param)s', Level %(level)d

source: Updating %(name)s with nValue %(nvalue)d and sValue %(svalue)s
fr: Mise à jour de %(name)s avec nValue %(nvalue)d et sValue %(svalue)s
